Repository: nmap/nmap
Catalog: zenmap/zenmapCore/data/locale/*.po
Languages: ka

source: Unknown Host
ka: უცნობი ჰოსტი

source: Unknown version
ka: უცნობი ვერსია

source: %(profile_name)s on %(targets)s
ka: %(profile_name)s %(targets)s-ზე

source: Use DIR as the user configuration directory. Default: %default
ka: DIR-ის გამოყენება მომხმარებლის კონფიგურაციის საქაღალდედ. ნაგულისხმევი: %default

source: Run %s with the specified args.
ka: %s-ის გაშვება მითითებული არგუმენტებით.

source: No profiles found
ka: პროფილები ვერ მოიძებნა

source: The {} file is missing or corrupted
ka: {} ფაილი არ არსებობს, ან დაზიანებულია

source: Please wait.
ka: გთხოვთ, მოითმინოთ.

source: Names
ka: სახელები

source: Arguments
ka: არგუმენტები

source: Select script files
ka: აირჩიეთ სკრიპტის ფაილები

source: Host Filter:
ka: ჰოსტის ფილტრი:

source: Hosts
ka: ჰოსტები

source: Services
ka: სერვისები

source: Host
ka: ჰოსტი

source: Service
ka: სერვისი

source: Scan Output
ka: სკანირების შედეგის გამოტანა

source: Select Scan Result
ka: აირჩიეთ სკანირების შედეგი

source: Error parsing file
ka: ფაილის ანალიზის შეცდომა

source: Cannot open selected file
ka: არჩეული ფაილის გახსნა შეუძლებელია

source: This error occurred while trying to open the file: %s
ka: ეს შეცდომა მოხდა ფაილის გახსნის მცდელობისას: %s

source: Compare Results
ka: შედეგების შედარება

source: A Scan
ka: სკანირება A

source: B Scan
ka: სკანირება B

source: Error running ndiff
ka: ndiff-ის გაშვების შეცდომა

source: There was an error running the ndiff program.
ka: შეცდომა ndiff პროგრამის გაშვებისას.

source: Error parsing ndiff output
ka: ndiff-ის გამოტანის დამუშავების შეცდომა

source: The ndiff process terminated with status code %d.
ka: პროცესი ndiff შეწყდა სტატუსის კოდით %d.

source: Command:
ka: ბრძანება:

source: Scan
ka: სკანირება

source: Cancel
ka: გაუქმება

source: Target:
ka: სამიზნე:

source: Profile:
ka: პროფილი:

source: Sc_an
ka: სკ_ანირება

source: _Save Scan
ka: _სკანირების შენახვა

source: Save current scan results
ka: მიმდინარე სკანირების შედეგების შენახვა

source: Save All Scans to _Directory
ka: ყველა სკანირების შენახვა საქაღალ_დეში

source: Save all scans into a directory
ka: ყველა სკანირების შენახვა საქაღალდეში

source: _Open Scan
ka: სკანირების გა_ხსნა

source: Open the results of a previous scan
ka: წინა სკანირების შედეგების გახსნა

source: _Open Scan in This Window
ka: სკანირების გახსნა ა_ხალ ფანჯარაში

source: Append a saved scan to the list of scans in this window.
ka: შენახული სკანირების ამ ფანჯარაში არსებული სკანირებების ბოლოში მიწერა.

source: _Tools
ka: _ხელსაწყოები

source: _New Window
ka: _ახალი ფანჯარა

source: Open a new scan window
ka: ახალი სკანირების ფანჯრის გახსნა

source: Close Window
ka: ფანჯრის დახურვა

source: Close this scan window
ka: სკანირების ფანჯრის დახურვა

source: Print...
ka: დაბეჭდვა...

source: Print the current scan
ka: მიმდინარე სკანირების დაბეჭდვა

source: Quit
ka: გასვლა

source: Quit the application
ka: აპლიკაციიდან გასვლა

source: New _Profile or Command
ka: ახალი _პროფილი ან ბრძანება

source: Create a new scan profile using the current command
ka: ახალი სკანირების პროფილის შექმნა მიმდინარე ბრძანებით

source: Search Scan Results
ka: სკანირების შედეგების ძებნა

source: Search for a scan result
ka: სკანირების შედეგების ძებნა

source: Filter Hosts
ka: ჰოსტების ფილტრი

source: Search for host by criteria
ka: ჰოსტის ძებნა პირობის მიხედვით

source: _Edit Selected Profile
ka: მონიშნული პროფილის ჩასწორ_ება

source: Edit selected scan profile
ka: მონიშნული სკანირების პროფილის რედაქტირება

source: _Profile
ka: _პროფილი

source: Compare Scan Results using Diffies
ka: სკანირების შედეგების შედარება Diffies_ის გამოყენებით

source: _Help
ka: _დახმარება

source: _Report a bug
ka: _შეცდომის პატაკი

source: Report a bug
ka: შეცდომის პატაკი

source: _About
ka: _შესახებ

source: About %s
ka: %s-ის შესახებ

source: Shows the application help
ka: აჩვენებს პროგრამის დახმარებას

source: Toggle Dark Mode
ka: მუქი რეჟიმის გადართვა

source: Can't save to database
ka: მონაცემთა ბაზაში შენახვა შეუძლებელია

source: Can't store unsaved scans to the recent scans database: %s
ka: შეუნახავი სკანირებების უახლესი სკანირების მონაცემთა ბაზაში დამახსოვრება შეუძლებელია: %s

source: Error loading file
ka: ფაილის ჩატვირთვის შეცდომა

source: Nothing to save
ka: შესანახი არაფერია

source: There is a scan still running. Wait until it finishes and then save.
ka: სკანირება ჯერ კიდევ გაშვებულია. მოითმინეთ, სანამ დასრულდება და შემდეგ შეინახეთ.

source: There are %u scans still running. Wait until they finish and then save.
ka: ჯერ კიდევ გაშვებულია %u სკანირება. დაელოდეთ მათ დასრულებას და შემდეგ შეინახეთ.

source: Scan is running
ka: სკანირება გაშვებულია

source: Save Scan
ka: სკანირების შენახვა

source: This scan has not been run yet. Start the scan with the "Scan" button first.
ka: ეს სკანირება ჯერ არ გაშვებულა. ჯერ გაუშვით სკანირება ღილაკით 'სკანირება'.

source: Choose a directory to save scans into
ka: აირჩიეთ დირექტორია სკანირებების შესანახად

source: Can't save file
ka: ფაილის შენახვა შეუძლებელია

source: Can't save recent scan information
ka: უახლესი სკანირების ინფორმაციის შენახვა შეუძლებელია

source: Can't open file to write. %s
ka: ფაილის ჩასაწერად გახსნა შეუძლებელია. %s

source: Close anyway
ka: მაინც დახურვა

source: Unsaved changes
ka: შეუნახავი ცვლილებები

source: The given scan has unsaved changes. What do you want to do?
ka: მოცემულ სკანირებას აქვს შეუნახავი ცვლილებები. რა გნებავთ, ვქნა?

source: Trying to close
ka: დახურვის მცდელობა

source: Can't save Zenmap configuration
ka: Zenmap-ის კონფიგურაციის შენახვა შეუძლებელია

source: Can't find documentation files
ka: დოკუმენტაციის ფაილების პოვნა შეუძლებელია

source: Empty Nmap Command
ka: ცარიელი Nmap-ის ბრძანება

source: Error building command
ka: ბრძანების აგების შეცდომა

source: Error message: %s
ka: შეცდომის შეტყობინება: %s

source: <undefined>
ka: <აღწერილი არაა>

source: plus the extra directory
ka: პლუს დამატებითი საქაღალდე

source: plus the extra directories
ka: პლუს დამატებითი საქაღალდეები

source: Error executing command
ka: ბრძანების შესრულების შეცდომა

source: Parse error
ka: დამუშავების შეცდომა

source: Cannot merge scan
ka: სკანირების შერწყმა შეუძლებელია

source: %(num_shown)d/%(total)d hosts shown
ka: %(num_shown)d/%(total)d ჰოსტი გამორთულია

source: Nmap Output
ka: Nmap-ის გამოტანა

source: Ports / Hosts
ka: პორტები / ჰოსტები

source: Topology
ka: ტოპოლოგია

source: Host Details
ka: ჰოსტის დეტალები

source: Scans
ka: სკანირებები

source: No host selected.
ka: ჰოსტები მონიშნული არაა.

source: Port
ka: პორტი

source: Protocol
ka: პროტოკოლი

source: State
ka: მდგომარეობა

source: Version
ka: ვერსია

source: Hostname
ka: ჰოსტის სახელი

source: Unknown
ka: უცნობი

source: How to Report a Bug
ka: როგორ მოგვწეროთ შეცდომის შესახებ

source: Search:
ka: ძებნა:

source: Expressions
ka: გამოსახულებები

source: Date
ka: თარიღი

source: No search method selected!
ka: ძებნის მეთოდი არჩეული არაა!

source: Not available
ka: ხელმისაწვდომი არაა

source: Nmap Version:
ka: Nmap-ის ვერსია:

source: Verbosity level:
ka: დიაგნოსტიკური შეტყობინებების დონე:

source: Debug level:
ka: გამართვის დონე:

source: Command Info
ka: ბრძანების ინფორმაცია

source: Started on:
ka: გაშვების დრო:

source: Finished on:
ka: დასრულების დრო:

source: Hosts up:
ka: ჩართული ჰოსტები:

source: Hosts down:
ka: გამორთული ჰოსტები:

source: Hosts scanned:
ka: სკანირებული ჰოსტები:

source: Open ports:
ka: ღია პორტები:

source: Filtered ports:
ka: გაფილტრული პორტები:

source: Closed ports:
ka: დახურული პორტები:

source: General Info
ka: ზოგადი ინფორმაცია

source: Scan Info
ka: სკანირების ინფორმაცია

source: Scan type:
ka: სკანირების ტიპი:

source: Protocol:
ka: პროტოკოლი:

source: # scanned ports:
ka: სკანირებული პორტების #:

source: Services:
ka: სერვისები:

source: Crash Report
ka: ანგარიში ავარიის შესახებ

source: Details
ka: დეტალები

source: Nmap Output Properties
ka: Nmap-ის გამოტანის თვისებები

source: details
ka: დეტალები

source: port listing title
ka: პორტის მოსმენის სათაური

source: open port
ka: ღია პორტი

source: closed port
ka: დახურული პორტი

source: filtered port
ka: გაფილტრული პორტი

source: date
ka: თარიღი

source: hostname
ka: ჰოსტის სახელი

source: Highlight definitions
ka: აღწერების გამოკვეთა

source: Text
ka: ტექსტი

source: Highlight
ka: გამოკვეთა

source: text color
ka: ტექსტის ფერი

source: highlight color
ka: გამოკვეთის ფერი

source: About %(nmap)s and %(zenmap)s
ka: %(nmap)s-ის და %(zenmap)s-ის შესახებ

source: %s credits
ka: %s-ის ავტორები

source: Written by
ka: ავტორი

source: Design
ka: დიზაინი

source: Contributors
ka: შემომწირავები

source: Translation
ka: თარგმანი

source: Running
ka: გაშვებულია

source: Unsaved
ka: შეუნახავი

source: Failed
ka: ჩავარდა

source: Canceled
ka: გაუქმებულია

source: Status
ka: სტატუსი

source: Command
ka: ბრძანება

source: Append Scan
ka: სკანირების ბოლოში მიწერა

source: Remove Scan
ka: სკანირების წაშლა

source: Cancel Scan
ka: სკანირების გაუქმება

source: Show the topology anyway
ka: ტოპოლოგიის მაინც ჩვენება

source: All files (%s)
ka: ყველა ფაილი (%s)

source: Nmap XML files (%s)
ka: Nmap-ის XML ფაილები (%s)

source: NSE scripts (%s)
ka: NSE სკრიპტები (%s)

source: By extension
ka: გაფართოებით

source: Nmap XML format (.xml)
ka: Nmap-ის XML ფორმატი (.xml)

source: Nmap text format (.nmap)
ka: Nmap-ის ტექსტური ფორმატი (.nmap)

source: Select File Type:
ka: აირჩიეთ ფაილის ტიპი:

source: Choose file
ka: ფაილის არჩევა

source: Profile Editor
ka: პროფილების რედაქტორი

source: Profile Information
ka: პროფილის ინფორმაცია

source: Profile name
ka: პროფილის სახელი

source: Description
ka: აღწერა

source: Save Changes
ka: ცვლილებების შენახვა

source: Help
ka: დახმარება

source: Profile
ka: პროფილი

source: Unnamed profile
ka: უსახელო პროფილი

source: You must provide a name for this profile.
ka: თქვენ უნდა მიუთითოთ სახელი ამ პროფილისთვის.

source: Disallowed profile name
ka: დაუშვებელი პროფილის სახელი

source: Deleting Profile
ka: პროფილის წაშლა

source: Search Scans
ka: სკანირებების ძებნა

source: Append
ka: ბოლოში მიწერა

source: Import error
ka: შემოტანის შეცდომა

source: A required module was not found.
ka: აუცილებელი მოდული ვერ მოიძებნა.

source: Error creating the per-user configuration directory
ka: მომხმარებლის საკუთარი კონფიგურაციის საქაღალდის შექმნის შეცდომა

source: Error parsing the configuration file
ka: კონფიგურაციის ფაილის დამუშავების შეცდომა

source: Restore default configuration?
ka: აღვადგინო ნაგულისხმევი კონფიგურაცია?

source: Non-root user
ka: არა-root მომხმარებელი

source: Host Status
ka: ჰოსტის სტატუსი

source: Addresses
ka: მისამართები

source: Hostnames
ka: ჰოსტის სახელები

source: Operating System
ka: ოპერაციული სისტემა

source: Ports used
ka: გამოყენებული პორტები

source: OS Classes
ka: OS-ის კლასები

source: TCP Sequence
ka: TCP მიმდევრობა

source: IP ID Sequence
ka: IP ID მიმდევრობა

source: TCP TS Sequence
ka: TCP TS მიმდევრობა

source: Comments
ka: კომენტარები

source: State:
ka: მდგომარეობა:

source: Scanned ports:
ka: სკანირებული პორტები:

source: Up time:
ka: ჩართულობის დრო:

source: Last boot:
ka: ბოლო ჩატვირთვა:

source: Vendor:
ka: მომწოდებელი:

source: Name - Type:
ka: სახელი - ტიპი:

source: Not Available
ka: ხელმისაწვდომი არაა

source: Name:
ka: სახელი:

source: Accuracy:
ka: სიზუსტე:

source: Port-Protocol-State:
ka: პორტი-პროტოკოლი-მდგომარეობა:

source: Type
ka: ტიპი

source: Vendor
ka: მომწოდებელი

source: OS Family
ka: ოს-ის ოჯახი

source: OS Generation
ka: OS-ის გენერაცია

source: Accuracy
ka: სიზუსტე

source: Difficulty:
ka: სირთულე:

source: Index:
ka: ინდექსი:

source: Values:
ka: მნიშვნელობები:

source: Class:
ka: კლასი:

source: Hosts viewer
ka: ჰოსტების დათვალიერება

source: Save Graphic
ka: გრაფიკის შენახვა

source: Hosts Viewer
ka: ჰოსტების დათვალიერება

source: Controls
ka: მმართველები

source: Fisheye
ka: თევზისთვალი

source: Legend
ka: ახსნა

source: Error saving snapshot
ka: სწრაფი ასლის შენახვის შეცდომა

source: Method
ka: მეთოდი

source: Count
ka: რაოდენობა

source: Reasons
ka: მიზეზები

source: No traceroute information available.
ka: traceroute-ის ინფორმაცია ხელმისაწვდომი არაა.

source: Name
ka: სახელი

source: DB Line
ka: DB ხაზი

source: Family
ka: ოჯახი

source: General
ka: ზოგადი

source: Ports (%s)
ka: პორტები (%s)

source: <unknown>
ka: <უცნობი>

source: <none>
ka: <არცერთი>

source: [%(port)d] service: %(servicefp)s
ka: [%(port)d] სერვისი: %(servicefp)s

source: <special field>
ka: <სპეციალური ველი>

source: Extraports (%s)
ka: დამატებითი პორტები (%s)

source: Special fields
ka: სპეციალური ველები

source: General information
ka: ზოგადი ინფორმაცია

source: Sequences
ka: მიმდევრობები

source: No sequence information.
ka: მიმდევრობის ინფორმაციის გარეშე.

source: No OS information.
ka: ოს-ის ინფორმაციის გარეშე.

source: Address:
ka: მისამართი:

source: Hostname:
ka: ჰოსტის სახელი:

source: %(lastboot)s (%(seconds)s seconds).
ka: %(lastboot)s (%(seconds)s წმ).

source: Match
ka: დამთხვევა

source: Class
ka: კლასი

source: Used ports:
ka: გამოყენებული პორტები:

source: Fingerprint
ka: თითის ანაბეჭდი

source: Values
ka: მნიშვნელობები

source: TCP Timestamp
ka: TCP დროის შტამპი

source: Topology Legend
ka: ტოპოლოგიის აღწერა

source: View full legend online
ka: სრული აღწერის ნახვა ინტერნეტში

source: host was not port scanned
ka: ჰოსტის პორტები არ დასკანერებულა

source: host with fewer than 3 open ports
ka: ჰოსტი 3-ზე ნაკლები ღია პორტით

source: host with 3 to 6 open ports
ka: ჰოსტი 3-6 ღია პორტით

source: host with more than 6 open ports
ka: ჰოსტი 6-ზე მეტი ღია პორტით

source: host is a router, switch, or WAP
ka: ჰოსტი ან რაუტერია, ან კომუტატორი, ან WAP

source: Traceroute connections
ka: Traceroute-is kavSirebi

source: Thicker line means higher round-trip time
ka: სქელი ხაზი ნიშნავს ორმხრივი მოგზაურობის უფრო მაღალ დროს

source: primary traceroute connection
ka: პირველადი traceroute კავშირი

source: alternate path
ka: ალტერნატიული გზა

source: no traceroute information
ka: traceroute-ის ინფორმაცია ხელმისაწვდომი არაა

source: missing traceroute hop
ka: აკლია traceroute-ის ნახტომი

source: Additional host icons
ka: დამატებითი ჰოსტის ხატულები

source: router
ka: რაუტერი

source: switch
ka: გადართვა

source: wireless access point
ka: უსადენო კავშირი წერტილი

source: firewall
ka: ბრანდმაუერი

source: host with some filtered ports
ka: ჰოსტი რამდენიმე გაფილტრული პორტით

source: Save Topology
ka: ტოპოლოგიის შენახვა

source: No filename extension
ka: ფაილის სახელის გაფართოების გარეშე

source: Unknown filename extension
ka: ფაილის სახელის უცნობი გაფართოება

source: Action
ka: ქმედება

source: Red
ka: წითელი

source: Yellow
ka: ყვითელი

source: Green
ka: მწვანე

source: <b>Fisheye</b> on ring
ka: <b>თევზისთვალი</b> რგოლზე

source: with interest factor
ka: საპროცენტო ფაქტორით

source: and spread factor
ka: და გავრცელების ფაქტორით

source: Interpolation
ka: ინტერპოლაცია

source: Cartesian
ka: დეკარტის

source: Polar
ka: პოლარული

source: Frames
ka: კადრები

source: Layout
ka: განლაგება

source: Symmetric
ka: სიმეტრიული

source: Weighted
ka: აწონილია

source: Ring gap
ka: რგოლის დაშორება

source: Lower ring gap
ka: დაბალი რგოლის დაშორება

source: View
ka: ხედი

source: Zoom
ka: მასშტაბი

source: Navigation
ka: ნავიგაცია

source: No node selected
ka: კვანძი არჩეული არაა

source: Alert
ka: გაფრთხილება

source: Ping
ka: პინგი

source: Scripting
ka: სკრიპტები

source: Target
ka: სამიზნე

source: Source
ka: წყარო

source: Other
ka: სხვა

source: Timing
ka: ქრონომეტრაჟი

source: Scan options
ka: სკანირების მორგება

source: Targets (optional):
ka: სამიზნეები (არასავალდებულო):

source: TCP scan:
ka: TCP სკანირება:

source: None
ka: არაფერი

source: ACK scan
ka: ACK სკანირება

source: FIN scan
ka: FIN სკანირება

source: Maimon scan
ka: Maimon სკანირება

source: Null scan
ka: ნულოვანი სკანირება

source: TCP SYN scan
ka: TCP SYN სკანირება

source: TCP connect scan
ka: TCP კავშირის სკანირება

source: Window scan
ka: ფანჯრის სკანირება

source: Xmas Tree scan
ka: საშობაო ხის სკანირება

source: Non-TCP scans:
ka: არა-TCP სკანირებები:

source: UDP scan
ka: UDP სკანირება

source: IP protocol scan
ka: IP პროტოკოლის სკანირება

source: List scan
ka: სკანირების სია

source: No port scan
ka: პორტების სკანირების გარეშე

source: SCTP INIT port scan
ka: SCTP INIT პორტის სკანირება

source: SCTP cookie-echo port scan
ka: SCTP cookie-echo პორტის სკანირება

source: Timing template:
ka: დროის ათვლის შაბლონი:

source: Set the timing template for IDS evasion.
ka: დროის ათვლის შაბლონის დაყენება IDS-ის თავიდან ასაცილებლად.

source: Paranoid
ka: პარანოიდული

source: Sneaky
ka: მზაკვრული

source: Polite
ka: თავაზიანი

source: Normal
ka: ნორმალური

source: Aggressive
ka: აგრესიული

source: Insane
ka: არანორმალური

source: Enable all advanced/aggressive options
ka: ყველა დამატებითი/აგრესიული პარამეტრის ჩართვა

source: Operating system detection
ka: ოპერაციული სისტემის გამოვლენა

source: Version detection
ka: ვერსიის გამოვლენა

source: Idle Scan (Zombie)
ka: უქმე სკანირება (ზომი)

source: FTP bounce attack
ka: FTP bounce შეტევა

source: Never do reverse DNS. This can slash scanning times.
ka: არასდროს მოხდეს DNS-ის უკუამოხსნა. ამას შეუძლია, სკანირების დრო ძალიან შეამციროს.

source: Disable reverse DNS resolution
ka: DNS-ის უკუამოხსნის გამორთვა

source: Enable IPv6 scanning.
ka: IPv6 სკანირების ჩართვა.

source: IPv6 support
ka: IPv6-ის მხარდაჭერა

source: Ping options
ka: პინგის მორგება

source: Don't ping before scanning
ka: არ დაპინგო სკანირებამდე

source: ICMP ping
ka: ICMP პინგი

source: ICMP timestamp request
ka: ICMP დროის შტამპის მოთხოვნა

source: ICMP netmask request
ka: ICMP ქსელის ნიღბის მოთხოვნა

source: ACK ping
ka: ACK პინგი

source: UDP probes
ka: UDP ზონდები

source: IPProto probes
ka: IPProto ზონდები

source: SCTP INIT ping probes
ka: SCTP INIT პინგის ზონდები

source: Scripting options (NSE)
ka: სკრიპტირების პარამეტრები (NSE)

source: Script scan
ka: სკრიპტით სკანირება

source: Scripts to run
ka: გასაშვები სკრიპტები

source: Script arguments
ka: სკრიპტის არგუმენტები

source: Show all information sent and received by the scripting engine.
ka: სრული ინფორმაციის ჩვენება სკრიპტების ძრავის მიერ გაგზავნილი და მიღებული ინფორმაციის შესახებ.

source: Trace script execution
ka: ტრეისის სკრიპტის შესრულება

source: Target options
ka: სამიზნის პარამეტრები

source: Excluded hosts/networks
ka: გამორიცხული ჰოსტები/ქსელები

source: Exclusion file
ka: გამორიცხვის ფაილი

source: Reads target list specification from an input file.
ka: კითხულობს სამიზნე სიის სპეციფიკაციას შეყვანის ფაილიდან.

source: Target list file
ka: სამიზნის სიის ფაილი

source: Scan random hosts
ka: შემთხვევითი ჰოსტების სკანირება

source: Ports to scan
ka: პორტები სკანირებისთვის

source: Fast scan
ka: სწრაფი სკანირება

source: Source options
ka: წყაროს მორგება

source: Use decoys to hide identity
ka: სატყუარების გამოყენება საკუთარი თავის დასამალად

source: Set source IP address
ka: წყარო IP მისამართის დაყენება

source: Set source port
ka: წყარო პორტის დაყენება

source: Tells Nmap what interface to send and receive packets on.
ka: ეუბნება Nmap-ს, რომელ ინტერფეისზე უნდა გაგზავნოს და მიიღოს პაკეტები.

source: Set network interface
ka: ქსელის ინტერფეისის დაყენება

source: Other options
ka: სხვა პარამეტრები

source: Any extra options to add to the command line.
ka: ბრძანების სტრიქონში დასამატებელი ნებისმიერი დამატებითი პარამეტრი.

source: Extra options defined by user
ka: მომხმარებლის მიერ აღწერილი დამატებითი პარამეტრები

source: Set IPv4 time to live (ttl)
ka: IPv4 სიცოცხლის დროის (ttl) დაყენება

source: Fragment IP packets
ka: IP პაკეტების ფრაგმენტაცია

source: Verbosity level
ka: დიაგნოსტიკური შეტყობინებების დონე

source: Debugging level
ka: გამართვის დონე

source: Print a summary of every packet sent or received.
ka: ყველა მიღებული ან გაგზავნილი პაკეტების შეჯამების გამოტანა.

source: Packet trace
ka: პაკეტის ტრეისი

source: Scan ports in order instead of randomizing them.
ka: პორტების სკანირება მიმდევრობით შემთხვევითობის მაგიერ.

source: Disable randomizing scanned ports
ka: სკანირებული პორტების შემთხვევით არჩევის გამორთვა

source: Trace routes to targets
ka: რაუტების ტრეისი სამიზნემდე

source: Max Retries
ka: მაქს. ცდები

source: Timing and performance
ka: დროის ათვლა და წარმადობა

source: Max time to scan a target
ka: სამიზნის სკანირების მაქსიმალური დრო

source: Max probe timeout
ka: ზონდის მაქს. მოლოდინის დრო

source: Min probe timeout
ka: ზონდის მინ. მოლოდინის დრო

source: Initial probe timeout
ka: საწყისი ზონდის მოლოდინის დრო

source: Scan no more than this many hosts in parallel.
ka: მაქს. ამდენი ჰოსტის სკანირება პარალელურად.

source: Max hosts in parallel
ka: მაქს. ჰოსტები პარალელურად

source: Scan at least this many hosts in parallel.
ka: მინიმუმ ამდენი ჰოსტის სკანირება პარალელურად.

source: Min hosts in parallel
ka: მინ. ჰოსტები პარალელურად

source: Max outstanding probes
ka: მაქს. სასწრაფო ზონდები

source: Min outstanding probes
ka: მინ. სასწრაფო ზონდები

source: Max scan delay
ka: მაქს. სკანირების დაყოვნება

source: Min delay between probes
ka: მინ. დაყოვნება ზონდებს შორის
